In [1]:
##Loads the SQL magic and opens a connection to MySQL on localhost.
%load_ext sql

In [2]:
%sql mysql+mysqlconnector://root:root@localhost

In [3]:
%%sql
#Lists all databases
Show databases

 * mysql+mysqlconnector://root:***@localhost
17 rows affected.

[('de_project',),
 ('dummy',),
 ('family',),
 ('g_project',),
 ('hotels',),
 ('information_schema',),
 ('interview_questions',),
 ('lyft',),
 ('mysql',),
 ('performance_schema',),
 ('sakila',),
 ('shrimali',),
 ('starbucks',),
 ('sys',),
 ('taxi',),
 ('uber',),
 ('world',)]

In [4]:
%%sql
#Sets the current database to 'world'
Use world

 * mysql+mysqlconnector://root:***@localhost
0 rows affected.

[]

In [5]:
%%sql
#List all tables in the world database
show tables

 * mysql+mysqlconnector://root:***@localhost
3 rows affected.

[('city',), ('country',), ('countrylanguage',)]

In [6]:
%%sql
#Shows column names, types, keys, and nullability.
desc city

 * mysql+mysqlconnector://root:***@localhost
5 rows affected.

[('ID', 'int', 'NO', 'PRI', None, 'auto_increment'),
 ('Name', 'char(35)', 'NO', '', '', ''),
 ('CountryCode', 'char(3)', 'NO', 'MUL', '', ''),
 ('District', 'char(20)', 'NO', '', '', ''),
 ('Population', 'int', 'NO', '', '0', '')]

In [7]:
%%sql
desc country

 * mysql+mysqlconnector://root:***@localhost
15 rows affected.

[('Code', 'char(3)', 'NO', 'PRI', '', ''),
 ('Name', 'char(52)', 'NO', '', '', ''),
 ('Continent', "enum('Asia','Europe','North America','Africa','Oceania','Antarctica','South America')", 'NO', '', 'Asia', ''),
 ('Region', 'char(26)', 'NO', '', '', ''),
 ('SurfaceArea', 'decimal(10,2)', 'NO', '', '0.00', ''),
 ('IndepYear', 'smallint', 'YES', '', None, ''),
 ('Population', 'int', 'NO', '', '0', ''),
 ('LifeExpectancy', 'decimal(3,1)', 'YES', '', None, ''),
 ('GNP', 'decimal(10,2)', 'YES', '', None, ''),
 ('GNPOld', 'decimal(10,2)', 'YES', '', None, ''),
 ('LocalName', 'char(45)', 'NO', '', '', ''),
 ('GovernmentForm', 'char(45)', 'NO', '', '', ''),
 ('HeadOfState', 'char(60)', 'YES', '', None, ''),
 ('Capital', 'int', 'YES', '', None, ''),
 ('Code2', 'char(2)', 'NO', '', '', '')]

In [16]:
%%sql
#Returns the first 5 rows (useful sanity check).
select *
from country
limit 5;

 * mysql+mysqlconnector://root:***@localhost
5 rows affected.

[('ABW', 'Aruba', 'North America', 'Caribbean', Decimal('193.00'), None, 103000, Decimal('78.4'), Decimal('828.00'), Decimal('793.00'), 'Aruba', 'Nonmetropolitan Territory of The Netherlands', 'Beatrix', 129, 'AW'),
 ('AFG', 'Afghanistan', 'Asia', 'Southern and Central Asia', Decimal('652090.00'), 1919, 22720000, Decimal('45.9'), Decimal('5976.00'), None, 'Afganistan/Afqanestan', 'Islamic Emirate', 'Mohammad Omar', 1, 'AF'),
 ('AGO', 'Angola', 'Africa', 'Central Africa', Decimal('1246700.00'), 1975, 12878000, Decimal('38.3'), Decimal('6648.00'), Decimal('7984.00'), 'Angola', 'Republic', 'José Eduardo dos Santos', 56, 'AO'),
 ('AIA', 'Anguilla', 'North America', 'Caribbean', Decimal('96.00'), None, 8000, Decimal('76.1'), Decimal('63.20'), None, 'Anguilla', 'Dependent Territory of the UK', 'Elisabeth II', 62, 'AI'),
 ('ALB', 'Albania', 'Europe', 'Southern Europe', Decimal('28748.00'), 1912, 3401200, Decimal('71.6'), Decimal('3205.00'), Decimal('2500.00'), 'Shqipëria', 'Republic', 'Rexhep Mejdani', 34, 'AL')]

In [11]:
%%sql
#Returns the population value for Germany.
Select population
from country
where name = 'Germany'

 * mysql+mysqlconnector://root:***@localhost
1 rows affected.

[(82164700,)]

In [13]:
%%sql
#Filters by a list of country names using IN.
Select name, population
from country
where name in ('Sweden', 'Norway', 'Denmark')

 * mysql+mysqlconnector://root:***@localhost
3 rows affected.

[('Denmark', 5330000), ('Norway', 4478500), ('Sweden', 8861400)]

In [15]:
%%sql
#Filters the'country' table to show countries whose surface area falls within the given range(200,000-250,000)
Select name, surfacearea
from country
where surfacearea between 200000 and 250000;

 * mysql+mysqlconnector://root:***@localhost
8 rows affected.

[('Belarus', Decimal('207600.00')),
 ('United Kingdom', Decimal('242900.00')),
 ('Ghana', Decimal('238533.00')),
 ('Guinea', Decimal('245857.00')),
 ('Guyana', Decimal('214969.00')),
 ('Laos', Decimal('236800.00')),
 ('Romania', Decimal('238391.00')),
 ('Uganda', Decimal('241038.00'))]

In [24]:
%%sql
#Selects the names of countries from the 'country' table where the population is equal to or greater than 200 million
Select name
from country
where population >= 200000000;

 * mysql+mysqlconnector://root:***@localhost
4 rows affected.

[('China',), ('Indonesia',), ('India',), ('United States',)]

In [25]:
%%sql
show tables

 * mysql+mysqlconnector://root:***@localhost
3 rows affected.

[('city',), ('country',), ('countrylanguage',)]

In [27]:
%%sql
/* 
Show the name and population in millions for the countries of 
the continent 'South America'
*/

Select name, population/ 1000000 as "population_in_millions"
from country
where Continent = 'South America';

 * mysql+mysqlconnector://root:***@localhost
14 rows affected.

[('Argentina', Decimal('37.0320')),
 ('Bolivia', Decimal('8.3290')),
 ('Brazil', Decimal('170.1150')),
 ('Chile', Decimal('15.2110')),
 ('Colombia', Decimal('42.3210')),
 ('Ecuador', Decimal('12.6460')),
 ('Falkland Islands', Decimal('0.0020')),
 ('French Guiana', Decimal('0.1810')),
 ('Guyana', Decimal('0.8610')),
 ('Peru', Decimal('25.6620')),
 ('Paraguay', Decimal('5.4960')),
 ('Suriname', Decimal('0.4170')),
 ('Uruguay', Decimal('3.3370')),
 ('Venezuela', Decimal('24.1700'))]

In [28]:
%%sql
#Show the name and population for France, Germany, Italy
select name, population
from country
where name in ('France','Germany', 'Italy')

 * mysql+mysqlconnector://root:***@localhost
3 rows affected.

[('Germany', 82164700), ('France', 59225700), ('Italy', 57680000)]

In [29]:
%%sql
#Show the countries which have a name that includes the word 'United'
Select name
from country
where name like 'United%';

 * mysql+mysqlconnector://root:***@localhost
4 rows affected.

[('United Arab Emirates',),
 ('United Kingdom',),
 ('United States Minor Outlying Islands',),
 ('United States',)]

In [40]:
%%sql
/*
Show the countries that are big by area or big by population. 
Show name, population and area.
*/
Select name, population, surfacearea
from country
where  surfacearea > 3000000 or population > 250000000

 * mysql+mysqlconnector://root:***@localhost
8 rows affected.

[('Antarctica', 0, Decimal('13120000.00')),
 ('Australia', 18886000, Decimal('7741220.00')),
 ('Brazil', 170115000, Decimal('8547403.00')),
 ('Canada', 31147000, Decimal('9970610.00')),
 ('China', 1277558000, Decimal('9572900.00')),
 ('India', 1013662000, Decimal('3287263.00')),
 ('Russian Federation', 146934000, Decimal('17075400.00')),
 ('United States', 278357000, Decimal('9363520.00'))]

In [42]:
%%sql
/*
 Show the countries that are big by area (more than 3 million) or big by population 
(more than 250 million) but not both. Show name, population and area.
*/
SELECT name, population, surfacearea
FROM country
WHERE (surfacearea > 3000000) <> (population > 250000000);

 * mysql+mysqlconnector://root:***@localhost
5 rows affected.

[('Antarctica', 0, Decimal('13120000.00')),
 ('Australia', 18886000, Decimal('7741220.00')),
 ('Brazil', 170115000, Decimal('8547403.00')),
 ('Canada', 31147000, Decimal('9970610.00')),
 ('Russian Federation', 146934000, Decimal('17075400.00'))]